In [1]:
import numpy as np
import pandas as pd

## Indexing, iteration

### 1) head()

In [2]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data=data)
df.head()

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [3]:
df.head(2) # Default is 5 rows

     Name  Age Address Qualification
0     Jai   27   Delhi           Msc
1  Princi   24  Kanpur            MA

### 2) at

In [4]:
# Access a single value for a row/column label pair.
# Similar to loc, in that both provide label-based lookups.
# Use at if you only need to get or set a single value in a DataFrame or Series.

df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]], index=[4, 5, 6], columns=['A', 'B', 'C'])
df

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

In [5]:
df.at[4, 'A']

0

In [6]:
df.at[6, 'C']

30

In [7]:
df.at[5, 'B'] = 100
df

    A    B   C
4   0    2   3
5   0  100   1
6  10   20  30

### 3) iat

In [8]:
# Access a single value for a row/column pair by integer position.

# Similar to iloc, in that both provide integer-based lookups.
# Use iat if you only need to get or set a single value in a DataFrame or Series.

df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]], columns=['A', 'B', 'C'])

df

    A   B   C
0   0   2   3
1   0   4   1
2  10  20  30

In [9]:
df.iat[0,0]

0

In [10]:
df.iat[2,2]

30

In [11]:
df.iat[0,2] = 5000
df

    A   B     C
0   0   2  5000
1   0   4     1
2  10  20    30

### 4) loc

In [12]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df = pd.DataFrame(data=data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [13]:
df.loc[[0]]

  Name  Age Address Qualification
0  Jai   27   Delhi           Msc

In [14]:
df.loc[0]

Name               Jai
Age                 27
Address          Delhi
Qualification      Msc
Name: 0, dtype: object

In [15]:
df.loc[2, 'Age']

22

In [16]:
df.loc[:, 'Name']

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [17]:
df.loc[[0,1],['Name','Address','Qualification']]

     Name Address Qualification
0     Jai   Delhi           Msc
1  Princi  Kanpur            MA

In [18]:
df.loc[0, 'Age'] = 32
df

     Name  Age    Address Qualification
0     Jai   32      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [19]:
df.loc[df['Age'] > 30]

   Name  Age  Address Qualification
0   Jai   32    Delhi           Msc
3  Anuj   32  Kannauj           Phd

In [20]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])

df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [21]:
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [22]:
df.loc[[False, False, True]]

            max_speed  shield
sidewinder          7       8

In [23]:
df.loc[df['shield'] > 6, ['max_speed']]

            max_speed
sidewinder          7

In [24]:
df.loc[['viper', 'sidewinder'], ['shield']] = 50
df

            max_speed  shield
cobra               1       2
viper               4      50
sidewinder          7      50

In [25]:
# Set value for an entire row

df.loc['cobra'] = 10
df

            max_speed  shield
cobra              10      10
viper               4      50
sidewinder          7      50

In [26]:
# Set value for an entire column
df.loc[:, 'max_speed'] = 30
df

            max_speed  shield
cobra              30      10
viper              30      50
sidewinder         30      50

In [27]:
# Set value for rows matching callable condition
df.loc[df['shield'] > 35] = 0
df

            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0

### 5) iloc --> Integer location

In [28]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df5 = pd.DataFrame(mydict)
df5

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [29]:
df5.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [30]:
df5.iloc[0]

a    1
b    2
c    3
d    4
Name: 0, dtype: int64

In [31]:
df5.iloc[1, 3]

400

In [32]:
df5.iloc[[0, 2], [1, 3]]

      b     d
0     2     4
2  2000  4000

In [33]:
df5.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

### 6) df.insert

### 7) df.items()

### 8) df.iteritems()

### 9) df.keys()

### 10) df.iterrows()

### 11) df.itertuples()

### 12) df.lookup()

### 13) df.pop()

### 14) df.tail()

### 15) df.get()

### 16) df.isin()

### 17) df.where()

### 18) df.mask()

### 19) df.query()